------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\JPE\stata\\logs\\Incentives_JPE_table1A.txt
  log type:  text
 opened on:   8 Feb 2011, 13:21:52

. ** DESCRIPTION: will create table 1 (A) of the paper;
. **cleaning enrollment in y2 , i.e. kids who should not be in attendance sheets in y2;
. use data\dta\y0_y2_assessmentfile.dta, clear;

. sort hplstudentkey;

. merge hplstudentkey using data\dta\enrollment_cleanup_y1_y2.dta;
(note: you are using old merge syntax; see [R] merge for new syntax)

.  tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     72,058       94.04       94.04
          2 |      1,957        2.55       96.59
          3 |      2,612        3.41      100.00
------------+-----------------------------------
      Total |     76,627      100.00

.  drop if _m==3 | _m==2;
(4569 observations deleted)

.  drop _m;

. drop if school_treatment==2 | school_treatment==3 | school_treatment==6 | school_treatment==7 |school_treatment==8;
(0 observations deleted)

. **first we will creat student attrition;
. **we are not calculating y2 on y1 student attrition because
> **of the messiness of the deprecation coefficient;
. ***for  year2 on year0 student attrition will depend on those
> ***students who did not take ANY year 2 test
> ***as a fraction of those who took at least 1 year 1 test;
. gen student_attrition_y2_y0_vra=.;
(72058 missing values generated)

. gen student_attrition_y1_y0=.;
(72058 missing values generated)

. **present y0;
. gen present_y0=1 if y0_present_maths==1 | y0_present_telugu==1;
(53427 missing values generated)

. replace present_y0=0 if y0_present_maths==0 & y0_present_telugu==0;
(4437 real changes made)

. **present y1;
. gen present_y1=1 if y1_lel_present_maths==1 | y1_lel_present_telugu==1 | y1_hel_present_maths==1 | y1_hel_present_telugu==1;
(46159 missing values generated)

. replace present_y1=0 if y1_lel_present_maths==0 & y1_lel_present_telugu==0 & y1_hel_present_maths==0 & y1_hel_present_telugu==0;
(3211 real changes made)

. **present y2;
. gen present_y2=1 if y2_lel_present_maths==1 | y2_lel_present_telugu==1 | y2_hel_present_maths==1 | y2_hel_present_telugu==1;
(47131 missing values generated)

. replace present_y2=0 if y2_lel_present_maths==0 & y2_lel_present_telugu==0 & y2_hel_present_maths==0 & y2_hel_present_telugu==0;
(10850 real changes made)

. ***generate variables needed to calculate student attrition;
. **dropout y1;
. gen dropout_y1=0 if present_y1==1 & present_y0==1;
(55256 missing values generated)

. replace dropout_y1=1 if present_y1==0 & present_y0==1 ;
(1278 real changes made)

. **dropout y2 vra;
. gen dropout_y2_vra=0 if present_y2==1 & present_y0==1 ;
(61748 missing values generated)

. replace dropout_y2_vra=1 if present_y2==0 & present_y0==1;
(2686 real changes made)

. ***calculating student attrition y2 on y0 with vra (valid reason for absence);
. forvalues i=1/7 {;
  2. count if  dropout_y2_vra==1 & school_treatment==`i';
  3. local dropout`num'=r(N);
  4. count if  present_y0==1 & school_treatment==`i' & class_y0!=5 & class_y1!=5;
  5. local present_y0`num'=r(N);
  6. replace student_attrition_y2_y0_vra=(`dropout`num'')/`present_y0`num''
> if  school_treatment==`i';
  7. };
  968
 4471
(24608 real changes made)
    0
    0
(0 real changes made)
    0
    0
(0 real changes made)
  799
 4163
(22429 real changes made)
  919
 4425
(25021 real changes made)
    0
    0
(0 real changes made)
    0
    0
(0 real changes made)

. ***calculating student attrition y1 on y0;
. forvalues i=1/7 {;
  2. count if  dropout_y1==1 & school_treatment==`i';
  3. local dropout`num'=r(N);
  4. count if  present_y0==1 & school_treatment==`i' & class_y1!=1;
  5. local present_y0`num'=r(N);
  6. replace student_attrition_y1_y0=(`dropout`num'')/`present_y0`num''
> if  school_treatment==`i';
  7. };
  496
 6314
(24608 real changes made)
    0
    0
(0 real changes made)
    0
    0
(0 real changes made)
  376
 5954
(22429 real changes made)
  406
 6363
(25021 real changes made)
    0
    0
(0 real changes made)
    0
    0
(0 real changes made)

. gen sa_dummy_y1=1 if present_y0==1 & dropout_y1==1;
(70780 missing values generated)

. replace sa_dummy_y1=0 if present_y0==1 & dropout_y1==0;
(16802 real changes made)

. gen sa_dummy_y2_vra=1 if present_y0==1 & dropout_y2_vra==1;
(69372 missing values generated)

. replace sa_dummy_y2_vra=0 if present_y0==1 & dropout_y2_vra==0;
(10310 real changes made)

. save data\dta\temp1.dta, replace;
(note: file data\dta\temp1.dta not found)
file data\dta\temp1.dta saved

. keep hplstudentkey sa_dummy*;

. sort hplstudentkey sa_dummy*;

. save data\dta\usc_sa_dummy_merge.dta, replace;
(note: file data\dta\usc_sa_dummy_merge.dta not found)
file data\dta\usc_sa_dummy_merge.dta saved

. use data\dta\temp1.dta, clear;

. bysort school_treatment: keep if _n==1;
(72055 observations deleted)

. clear;

. use data\dta\y0_y2_assessmentfile.dta, clear;

. **renormalizing baseline totals on treatments 1 , 4 ,and 5;
. **Dropping unecessary treatments;
. drop if school_treatment==2 | school_treatment==3 | school_treatment==6 | school_treatment==7 |school_treatment==8;
(0 observations deleted)

. **normalizing y0 scores;
. gen y0_nts145_maths=.;
(74670 missing values generated)

. gen y0_nts145_telugu=.;
(74670 missing values generated)

. foreach subject in maths telugu {;
  2.         foreach num of numlist 2/5 {;
  3.                 summ y0_total_`subject' if class_y0==`num';
  4.                 local mean=r(mean);
  5.                 local sd=r(sd);
  6.                 disp `mean';
  7.                 disp `sd';
  8.                 replace y0_nts145_`subject'=(y0_total_`subject'-`mean')/`sd' if class_y0==`num' ;
  9.         };
 10. };

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      3890    .1984679    .1847348          0        .96
.19846787
.18473478
(3890 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      4404    .2214302     .177768          0   .9642857
.2214302
.17776802
(4404 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      5091    .1428808    .1336072          0     .84375
.14288082
.13360724
(5091 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      5474     .166611    .1285103          0         .8
.166611
.12851029
(5474 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      3999     .384146    .2152991          0          1
.38414604
.21529907
(3999 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      4480    .3420839    .2112886          0          1
.34208387
.21128856
(4480 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      5179    .3508464    .1926371          0   .9833333
.35084637
.19263713
(5179 real changes made)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      5525    .3135294    .2374789          0          1
.31352941
.23747891
(5525 real changes made)

. replace y0_nts145_maths=0 if class_y1==1;
(6806 real changes made)

. replace y0_nts145_telugu=0 if class_y1==1;
(6806 real changes made)

. sort hplstudentkey;

. merge hplstudentkey using data\dta\usc_sa_dummy_merge.dta;
(note: you are using old merge syntax; see [R] merge for new syntax)

. tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,612        3.50        3.50
          3 |     72,058       96.50      100.00
------------+-----------------------------------
      Total |     74,670      100.00

. drop if _m==2;
(0 observations deleted)

. reg sa_dummy_y1 II GI, cluster(apfschoolcode);

Linear regression                                      Number of obs =   18080
                                                       F(  2,   299) =    1.90
                                                       Prob > F      =  0.1519
                                                       R-squared     =  0.0008
                                                       Root MSE      =  .25622

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
 sa_dummy_y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |   -.014713   .0089557    -1.64   0.101    -.0323372    .0029111
          GI |   -.016087   .0087574    -1.84   0.067    -.0333209    .0011469
       _cons |   .0808476   .0069585    11.62   0.000     .0671538    .0945414
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   299) =    1.90
            Prob > F =    0.1519

. reg y0_nts145_maths II GI if sa_dummy_y1==1, cluster(apfschoolcode);

Linear regression                                      Number of obs =    1201
                                                       F(  2,   246) =    0.26
                                                       Prob > F      =  0.7701
                                                       R-squared     =  0.0012
                                                       Root MSE      =  .95667

                        (Std. Err. adjusted for 247 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0517181   .1068621    -0.48   0.629    -.2621994    .1587632
          GI |    .032322   .0964822     0.34   0.738    -.1577145    .2223585
       _cons |  -.1662541   .0599482    -2.77   0.006    -.2843314   -.0481769
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   246) =    0.26
            Prob > F =    0.7701

. reg y0_nts145_telugu II GI if sa_dummy_y1==1, cluster(apfschoolcode);

Linear regression                                      Number of obs =    1254
                                                       F(  2,   247) =    0.45
                                                       Prob > F      =  0.6365
                                                       R-squared     =  0.0018
                                                       Root MSE      =  .96985

                        (Std. Err. adjusted for 248 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~u |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |   .0155466   .1018134     0.15   0.879    -.1849866    .2160799
          GI |   .0959557   .1052017     0.91   0.363    -.1112511    .3031625
       _cons |  -.2638287     .06823    -3.87   0.000    -.3982155   -.1294419
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   247) =    0.45
            Prob > F =    0.6365

. reg sa_dummy_y2_vra II GI if class_y0!=5 & class_y1!=5, cluster(apfschoolcode);

Linear regression                                      Number of obs =   12996
                                                       F(  2,   298) =    1.48
                                                       Prob > F      =  0.2285
                                                       R-squared     =  0.0008
                                                       Root MSE      =  .40482

                        (Std. Err. adjusted for 299 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
sa_dummy_y~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0117678   .0171439    -0.69   0.493    -.0455063    .0219708
          GI |  -.0273841   .0159161    -1.72   0.086    -.0587062    .0039381
       _cons |   .2194514   .0109867    19.97   0.000       .19783    .2410728
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   298) =    1.48
            Prob > F =    0.2285

. reg y0_nts145_maths II GI if sa_dummy_y2_vra==1 & class_y0!=5 & class_y1!=5, cluster(apfschoolcode);

Linear regression                                      Number of obs =    2556
                                                       F(  2,   294) =    0.59
                                                       Prob > F      =  0.5569
                                                       R-squared     =  0.0015
                                                       Root MSE      =  1.0147

                        (Std. Err. adjusted for 295 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |   -.008176   .0935494    -0.09   0.930    -.1922872    .1759353
          GI |   .0824452   .0914033     0.90   0.368    -.0974424    .2623328
       _cons |  -.1320606    .064373    -2.05   0.041    -.2587508   -.0053703
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   294) =    0.59
            Prob > F =    0.5569

. reg y0_nts145_telugu II GI if sa_dummy_y2_vra==1 & class_y0!=5 & class_y1!=5, cluster(apfschoolcode);

Linear regression                                      Number of obs =    2655
                                                       F(  2,   294) =    0.45
                                                       Prob > F      =  0.6379
                                                       R-squared     =  0.0014
                                                       Root MSE      =    1.02

                        (Std. Err. adjusted for 295 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~u |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0286406   .0993177    -0.29   0.773    -.2241043    .1668232
          GI |   .0665323   .1026923     0.65   0.518    -.1355729    .2686376
       _cons |  -.1801396   .0705902    -2.55   0.011    -.3190658   -.0412135
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   294) =    0.45
            Prob > F =    0.6379

. **additional: redoing panel B baseline normalised scores, testing for equality across treatments;
. **mean percentage and normalized scores for the three groups;
. foreach num of numlist 1 4 5{;
  2.         summ y0_total_maths if school_treatment==`num';
  3.         summ y0_nts145_maths if school_treatment==`num';
  4.         summ y0_total_telugu if school_treatment==`num';
  5.         summ y0_nts145_telugu if school_treatment==`num';
  6. };

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      6370    .1847127    .1630938          0   .9642857

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~s |      8726    .0230284    .8845612   -1.29648   5.011848

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      6471    .3509926     .218312          0          1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~u |      8827    .0193034    .8619574  -1.821281   3.113827

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      6058    .1795269    .1549933          0        .96

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~s |      8258    .0004491    .8383849   -1.29648   5.245742

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      6173    .3494398     .219104          0   .9910714

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~u |      8373    .0155546    .8663519  -1.821281    3.07157

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_m~s |      6431    .1745389    .1551278          0        .92

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~s |      8681    -.023575     .846171   -1.29648   5.011848

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_total_t~u |      6539    .3348607    .2124499          0          1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
y0_nts145_~u |      8789   -.0342052    .8481827  -1.821281   3.283308

. reg y0_total_maths II GI , cluster(apfschoolcode);

Linear regression                                      Number of obs =   18859
                                                       F(  2,   299) =    0.37
                                                       Prob > F      =  0.6877
                                                       R-squared     =  0.0007
                                                       Root MSE      =  .15782

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_total_m~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0101738    .011768    -0.86   0.388    -.0333325    .0129849
          GI |  -.0051857   .0118861    -0.44   0.663    -.0285768    .0182053
       _cons |   .1847127   .0087896    21.02   0.000     .1674154    .2020099
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   299) =    0.37
            Prob > F =    0.6877

. reg y0_nts145_maths II GI if  class_y1!=1 , cluster(apfschoolcode) ;

Linear regression                                      Number of obs =   18859
                                                       F(  2,   299) =    0.35
                                                       Prob > F      =  0.7046
                                                       R-squared     =  0.0007
                                                       Root MSE      =  .99963

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0633688   .0758867    -0.84   0.404    -.2127084    .0859708
          GI |  -.0309334   .0767567    -0.40   0.687    -.1819852    .1201184
       _cons |   .0315456   .0563283     0.56   0.576    -.0793046    .1423958
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   299) =    0.35
            Prob > F =    0.7046

. reg y0_total_telugu II GI , cluster(apfschoolcode);

Linear regression                                      Number of obs =   19183
                                                       F(  2,   299) =    0.65
                                                       Prob > F      =  0.5241
                                                       R-squared     =  0.0011
                                                       Root MSE      =  .21659

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_total_t~u |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0161319    .015786    -1.02   0.308    -.0471977    .0149339
          GI |  -.0015528   .0165533    -0.09   0.925    -.0341285    .0310229
       _cons |   .3509926   .0115732    30.33   0.000     .3282174    .3737678
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   299) =    0.65
            Prob > F =    0.5241

. reg y0_nts145_telugu II GI if class_y1!=1 , cluster(apfschoolcode) ;

Linear regression                                      Number of obs =   19183
                                                       F(  2,   299) =    0.63
                                                       Prob > F      =  0.5322
                                                       R-squared     =  0.0011
                                                       Root MSE      =  .99942

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y0_nts145_~u |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          II |  -.0723063   .0723307    -1.00   0.318     -.214648    .0700355
          GI |  -.0052334   .0755678    -0.07   0.945    -.1539454    .1434786
       _cons |   .0263315   .0528765     0.50   0.619    -.0777258    .1303888
------------------------------------------------------------------------------

. test  II=GI=0;

 ( 1)  II - GI = 0
 ( 2)  II = 0

       F(  2,   299) =    0.63
            Prob > F =    0.5322

. log close;
      name:  <unnamed>
       log:  c:\JPE\stata\\logs\\Incentives_JPE_table1A.txt
  log type:  text
 closed on:   8 Feb 2011, 13:21:59
------------------------------------------------------------------------------------------------------------------------------------
