------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\JPE\stata\\logs\\Incentives_JPE_table2_SA.txt
  log type:  text
 opened on:   8 Feb 2011, 13:22:24

. use data\dta\Incentives_JPE_analysis_starter_file.dta, clear;

. local y1_y0_controls "prox_index_y1 infra_index_y1  Male SC ST OBC  parent_literacy_index hh_affluence_index";

. local y2_y1_controls "prox_index_y2 infra_index_y2  Male SC ST OBC parent_literacy_index hh_affluence_index";

. local y2_y0_controls "prox_index_mean infra_index_mean   Male SC ST OBC parent_literacy_index hh_affluence_index";

.         **keeping only one observation per student per subject (i.e. removing round LEL or HEL as a dimension);
. bysort hplstudentkey sub : keep if _n==1;
(96992 observations deleted)

. drop level;

. areg y1_nts_level_mean y0_nts  incentive [pweight=1/(1-p_only_baseline_y1)]  if inlist(school_treatment,1,4,5)  , absorb(U_MC) clu
> ster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   42145
                                                       F(  2,   299) =  798.91
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3090
                                                       Adj R-squared =  0.3081
                                                       Root MSE      =   .8302

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .5032776   .0125916    39.97   0.000     .4784982     .528057
   incentive |   .1467007   .0417315     3.52   0.001     .0645762    .2288253
       _cons |  -.0256656   .0329216    -0.78   0.436    -.0904531    .0391219
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y1_y0_comb_nc;

. areg y1_nts_level_mean y0_nts incentive `y1_y0_controls' [pweight=1/(1-p_all_controls_y1)]  if inlist(school_treatment,1,4,5)  , a
> bsorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   37617
                                                       F( 10,   293) =  206.77
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3414
                                                       Adj R-squared =  0.3403
                                                       Root MSE      =  .80991

                        (Std. Err. adjusted for 294 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4984539   .0126323    39.46   0.000     .4735924    .5233154
   incentive |   .1622475   .0413354     3.93   0.000     .0808956    .2435995
prox_index~1 |   .0024814   .0057411     0.43   0.666    -.0088176    .0137804
infra_inde~1 |   .0190957    .015307     1.25   0.213    -.0110299    .0492212
        Male |   .0170138   .0119442     1.42   0.155    -.0064936    .0405211
          SC |  -.0147275    .031607    -0.47   0.642    -.0769331    .0474781
          ST |  -.1537035   .0642461    -2.39   0.017    -.2801458   -.0272612
         OBC |   .0069189   .0285321     0.24   0.809    -.0492348    .0630727
parent_lit~x |   .0602103   .0068801     8.75   0.000     .0466696     .073751
hh_affluen~x |   .0348234   .0060327     5.77   0.000     .0229505    .0466963
       _cons |  -.3147837   .1094972    -2.87   0.004    -.5302845    -.099283
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y1_y0_comb_c;

. areg y2_nts_level_mean y1_nts_level_mean incentive [pweight=1/(1-p_only_baseline_y2_y1)] if inlist(school_treatment,1,4,5) & cheat
> ers==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   38777
                                                       F(  2,   297) =  509.35
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3022
                                                       Adj R-squared =  0.3013
                                                       Root MSE      =  .85478

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .5602807   .0175548    31.92   0.000     .5257332    .5948282
   incentive |   .1417772   .0428507     3.31   0.001     .0574478    .2261066
       _cons |  -.0673194   .0333912    -2.02   0.045    -.1330327   -.0016061
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y2_y1_comb_nc;

. areg y2_nts_level_mean y1_nts_level_mean incentive `y1_y0_controls' [pweight=1/(1-p_all_controls_y2_y1)] if inlist(school_treatmen
> t,1,4,5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   32094
                                                       F( 10,   291) =  126.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3342
                                                       Adj R-squared =  0.3329
                                                       Root MSE      =  .84358

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .5689981   .0180998    31.44   0.000     .5333751    .6046212
   incentive |   .1310891   .0431966     3.03   0.003     .0460717    .2161065
prox_index~1 |   .0157988   .0074161     2.13   0.034     .0012029    .0303948
infra_inde~1 |   .0181142   .0197215     0.92   0.359    -.0207008    .0569291
        Male |   .0130605   .0151673     0.86   0.390     -.016791    .0429119
          SC |  -.0615901   .0395595    -1.56   0.121    -.1394492     .016269
          ST |   -.062271   .0739679    -0.84   0.401    -.2078508    .0833088
         OBC |   -.019712   .0298872    -0.66   0.510    -.0785345    .0391105
parent_lit~x |   .0439105   .0074103     5.93   0.000      .029326     .058495
hh_affluen~x |   .0239114   .0071709     3.33   0.001     .0097979    .0380249
       _cons |  -.4427763   .1443632    -3.07   0.002    -.7269046    -.158648
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y2_y1_comb_c;

. areg y2_nts_level_mean y0_nts incentive [pweight=1/(1-p_only_baseline_y2)]  if inlist(school_treatment,1,4,5) & cheaters==0, absor
> b(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   29760
                                                       F(  2,   297) =  474.64
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2389
                                                       Adj R-squared =  0.2376
                                                       Root MSE      =  .88162

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4502943   .0149161    30.19   0.000     .4209396     .479649
   incentive |   .2149125   .0472186     4.55   0.000     .1219871    .3078378
       _cons |  -.0705269   .0349597    -2.02   0.045    -.1393271   -.0017268
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y2_y0_comb_nc;

. areg y2_nts_level_mean y0_nts incentive `y1_y0_controls' [pweight=1/(1-p_all_controls_y2)]  if inlist(school_treatment,1,4,5) & ch
> eaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   24665
                                                       F( 10,   291) =  108.03
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2774
                                                       Adj R-squared =  0.2757
                                                       Root MSE      =  .85532

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4448726   .0149299    29.80   0.000     .4154884    .4742569
   incentive |   .2177544   .0475333     4.58   0.000     .1242017    .3113071
prox_index~1 |   .0150706   .0097164     1.55   0.122    -.0040528     .034194
infra_inde~1 |   .0262187   .0243377     1.08   0.282    -.0216815    .0741188
        Male |   .0215344   .0159964     1.35   0.179    -.0099489    .0530176
          SC |  -.0241333   .0439456    -0.55   0.583    -.1106248    .0623582
          ST |  -.0537848   .0689299    -0.78   0.436    -.1894492    .0818796
         OBC |   .0386536   .0340049     1.14   0.257    -.0282732    .1055804
parent_lit~x |   .0585698   .0077972     7.51   0.000     .0432237     .073916
hh_affluen~x |   .0324165   .0082752     3.92   0.000     .0161295    .0487034
       _cons |  -.5707739   .1846752    -3.09   0.002    -.9342424   -.2073055
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store y2_y0_comb_c;

. estout y1_y0_comb_nc y1_y0_comb_c y2_y1_comb_nc y2_y1_comb_c y2_y0_comb_nc y2_y0_comb_c , stats(N r2)  cells(b(fmt(3)) se(par star
>  fmt(3)))starlevels(* 0.10 ** 0.05 *** .01 ) ;

------------------------------------------------------------------------------------------------------------
             y1_y0_comb~c    y1_y0_comb_c    y2_y1_comb~c    y2_y1_comb_c    y2_y0_comb~c    y2_y0_comb_c   
                     b/se            b/se            b/se            b/se            b/se            b/se   
------------------------------------------------------------------------------------------------------------
y0_nts              0.503           0.498                                           0.450           0.445   
                  (0.013)***      (0.013)***                                      (0.015)***      (0.015)***
incentive           0.147           0.162           0.142           0.131           0.215           0.218   
                  (0.042)***      (0.041)***      (0.043)***      (0.043)***      (0.047)***      (0.048)***
prox_index~1                        0.002                           0.016                           0.015   
                                  (0.006)                         (0.007)**                       (0.010)   
infra_inde~1                        0.019                           0.018                           0.026   
                                  (0.015)                         (0.020)                         (0.024)   
Male                                0.017                           0.013                           0.022   
                                  (0.012)                         (0.015)                         (0.016)   
SC                                 -0.015                          -0.062                          -0.024   
                                  (0.032)                         (0.040)                         (0.044)   
ST                                 -0.154                          -0.062                          -0.054   
                                  (0.064)**                       (0.074)                         (0.069)   
OBC                                 0.007                          -0.020                           0.039   
                                  (0.029)                         (0.030)                         (0.034)   
parent_lit~x                        0.060                           0.044                           0.059   
                                  (0.007)***                      (0.007)***                      (0.008)***
hh_affluen~x                        0.035                           0.024                           0.032   
                                  (0.006)***                      (0.007)***                      (0.008)***
y1_nts_lev~n                                        0.560           0.569                                   
                                                  (0.018)***      (0.018)***                                
_cons              -0.026          -0.315          -0.067          -0.443          -0.071          -0.571   
                  (0.033)         (0.109)***      (0.033)**       (0.144)***      (0.035)**       (0.185)***
------------------------------------------------------------------------------------------------------------
N               42145.000       37617.000       38777.000       32094.000       29760.000       24665.000   
r2                  0.309           0.341           0.302           0.334           0.239           0.277   
------------------------------------------------------------------------------------------------------------

. *********MATHS***********;
. areg y1_nts_level_mean y0_nts incentive [pweight=1/(1-p_only_baseline_y1)]  if sub==1 & inlist(school_treatment,1,4,5)  , absorb(U
> _MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   20946
                                                       F(  2,   299) =  449.52
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2977
                                                       Adj R-squared =  0.2960
                                                       Root MSE      =  .86141

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4923052    .016426    29.97   0.000     .4599799    .5246304
   incentive |   .1771651   .0477889     3.71   0.000     .0831199    .2712102
       _cons |  -.0315661   .0363901    -0.87   0.386    -.1031791     .040047
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y1_y0_m_nc;

. areg y1_nts_level_mean y0_nts incentive `y1_y0_controls' [pweight=1/(1-p_only_baseline_y1)]  if sub==1 & inlist(school_treatment,1
> ,4,5)  , absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   18700
                                                       F( 10,   293) =  123.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3314
                                                       Adj R-squared =  0.3293
                                                       Root MSE      =  .84094

                        (Std. Err. adjusted for 294 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4919871   .0163134    30.16   0.000     .4598808    .5240934
   incentive |   .1932196   .0483377     4.00   0.000     .0980865    .2883526
prox_index~1 |   .0044633    .006791     0.66   0.512    -.0089021    .0178287
infra_inde~1 |   .0187967   .0174794     1.08   0.283    -.0156045    .0531978
        Male |   .0346006   .0139964     2.47   0.014     .0070544    .0621467
          SC |  -.0266138    .035864    -0.74   0.459    -.0971974    .0439698
          ST |   -.128811   .0720551    -1.79   0.075    -.2706221    .0130002
         OBC |   .0034613   .0326868     0.11   0.916    -.0608695     .067792
parent_lit~x |   .0550006   .0076561     7.18   0.000     .0399327    .0700686
hh_affluen~x |   .0358285   .0074443     4.81   0.000     .0211776    .0504795
       _cons |  -.3498715   .1264164    -2.77   0.006    -.5986707   -.1010723
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y1_y0_m_c;

. areg y2_nts_level_mean y1_nts_level_mean incentive [pweight=1/(1-p_only_baseline_y2_y1)]  if sub==1 & inlist(school_treatment,1,4,
> 5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   19354
                                                       F(  2,   297) =  229.80
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2934
                                                       Adj R-squared =  0.2915
                                                       Root MSE      =  .88512

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .5048437   .0236118    21.38   0.000     .4583761    .5513113
   incentive |   .1763312   .0508882     3.47   0.001     .0761841    .2764782
       _cons |  -.0630226   .0400462    -1.57   0.117    -.1418328    .0157877
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y1_m_nc;

. areg y2_nts_level_mean y1_nts_level_mean incentive   `y1_y0_controls' [pweight=1/(1-p_all_controls_y2_y1)] if sub==1 & inlist(scho
> ol_treatment,1,4,5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   16026
                                                       F( 10,   291) =   70.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3224
                                                       Adj R-squared =  0.3199
                                                       Root MSE      =   .8765

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .5094624   .0245328    20.77   0.000     .4611783    .5577465
   incentive |   .1685684    .050884     3.31   0.001      .068421    .2687157
prox_index~1 |   .0139856   .0084293     1.66   0.098    -.0026046    .0305758
infra_inde~1 |   .0353718   .0223436     1.58   0.114    -.0086039    .0793474
        Male |   .0537564   .0171417     3.14   0.002      .020019    .0874938
          SC |  -.0693474   .0456846    -1.52   0.130    -.1592615    .0205667
          ST |  -.0238058   .0866287    -0.27   0.784     -.194304    .1466925
         OBC |  -.0091447   .0362119    -0.25   0.801    -.0804152    .0621257
parent_lit~x |    .037773   .0091227     4.14   0.000     .0198181    .0557279
hh_affluen~x |   .0224773   .0087106     2.58   0.010     .0053336     .039621
       _cons |  -.4839269   .1629397    -2.97   0.003    -.8046167   -.1632371
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y1_m_c;

. areg y2_nts_level_mean y0_nts  incentive [pweight=1/(1-p_only_baseline_y2)]  if sub==1 & inlist(school_treatment,1,4,5) & cheaters
> ==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   14797
                                                       F(  2,   297) =  198.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2457
                                                       Adj R-squared =  0.2430
                                                       Root MSE      =  .91109

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4137963    .021422    19.32   0.000     .3716382    .4559544
   incentive |    .267619   .0546809     4.89   0.000     .1600078    .3752302
       _cons |  -.0645873   .0410496    -1.57   0.117    -.1453723    .0161977
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y0_m_nc;

. areg y2_nts_level_mean y0_nts  incentive `y1_y0_controls' [pweight=1/(1-p_all_controls_y2)]  if sub==1 & inlist(school_treatment,1
> ,4,5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   12255
                                                       F( 10,   291) =   50.68
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2791
                                                       Adj R-squared =  0.2756
                                                       Root MSE      =  .88634

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4085037   .0213915    19.10   0.000     .3664019    .4506054
   incentive |   .2724327   .0554296     4.91   0.000     .1633389    .3815264
prox_index~1 |   .0176725   .0119738     1.48   0.141    -.0058938    .0412388
infra_inde~1 |   .0419758   .0288269     1.46   0.146      -.01476    .0987115
        Male |     .05501   .0184127     2.99   0.003     .0187711    .0912489
          SC |  -.0265639   .0501633    -0.53   0.597    -.1252927     .072165
          ST |   .0109293   .0813603     0.13   0.893    -.1491999    .1710586
         OBC |   .0525489    .041119     1.28   0.202    -.0283795    .1334772
parent_lit~x |   .0460837   .0093433     4.93   0.000     .0276947    .0644727
hh_affluen~x |   .0270587    .009568     2.83   0.005     .0082275    .0458899
       _cons |  -.6433111   .2269187    -2.83   0.005    -1.089921   -.1967012
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y0_m_c;

. estout y1_y0_m_nc y1_y0_m_c y2_y1_m_nc y2_y1_m_c y2_y0_m_nc y2_y0_m_c  ,stats(N r2) cells(b(fmt(3)) se(par star fmt(3)))starlevels
> (* 0.10 ** 0.05 *** .01 );

------------------------------------------------------------------------------------------------------------
               y1_y0_m_nc       y1_y0_m_c      y2_y1_m_nc       y2_y1_m_c      y2_y0_m_nc       y2_y0_m_c   
                     b/se            b/se            b/se            b/se            b/se            b/se   
------------------------------------------------------------------------------------------------------------
y0_nts              0.492           0.492                                           0.414           0.409   
                  (0.016)***      (0.016)***                                      (0.021)***      (0.021)***
incentive           0.177           0.193           0.176           0.169           0.268           0.272   
                  (0.048)***      (0.048)***      (0.051)***      (0.051)***      (0.055)***      (0.055)***
prox_index~1                        0.004                           0.014                           0.018   
                                  (0.007)                         (0.008)*                        (0.012)   
infra_inde~1                        0.019                           0.035                           0.042   
                                  (0.017)                         (0.022)                         (0.029)   
Male                                0.035                           0.054                           0.055   
                                  (0.014)**                       (0.017)***                      (0.018)***
SC                                 -0.027                          -0.069                          -0.027   
                                  (0.036)                         (0.046)                         (0.050)   
ST                                 -0.129                          -0.024                           0.011   
                                  (0.072)*                        (0.087)                         (0.081)   
OBC                                 0.003                          -0.009                           0.053   
                                  (0.033)                         (0.036)                         (0.041)   
parent_lit~x                        0.055                           0.038                           0.046   
                                  (0.008)***                      (0.009)***                      (0.009)***
hh_affluen~x                        0.036                           0.022                           0.027   
                                  (0.007)***                      (0.009)**                       (0.010)***
y1_nts_lev~n                                        0.505           0.509                                   
                                                  (0.024)***      (0.025)***                                
_cons              -0.032          -0.350          -0.063          -0.484          -0.065          -0.643   
                  (0.036)         (0.126)***      (0.040)         (0.163)***      (0.041)         (0.227)***
------------------------------------------------------------------------------------------------------------
N               20946.000       18700.000       19354.000       16026.000       14797.000       12255.000   
r2                  0.298           0.331           0.293           0.322           0.246           0.279   
------------------------------------------------------------------------------------------------------------

. ***********TELUGU*************;
. areg y1_nts_level_mean y0_nts incentive [pweight=1/(1-p_only_baseline_y1)]  if sub==2 & inlist(school_treatment,1,4,5)  , absorb(U
> _MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   21199
                                                       F(  2,   299) =  723.39
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3313
                                                       Adj R-squared =  0.3297
                                                       Root MSE      =   .7932

                        (Std. Err. adjusted for 300 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .5201708   .0136821    38.02   0.000     .4932455    .5470962
   incentive |   .1167217   .0393879     2.96   0.003     .0392091    .1942344
       _cons |  -.0199774   .0323153    -0.62   0.537    -.0835717    .0436169
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y1_y0_t_nc;

. areg y1_nts_level_mean y0_nts incentive `y1_y0_controls' [pweight=1/(1-p_only_baseline_y1)]  if sub==2 & inlist(school_treatment,1
> ,4,5)  , absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   18917
                                                       F( 10,   293) =  186.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3636
                                                       Adj R-squared =  0.3616
                                                       Root MSE      =  .77293

                        (Std. Err. adjusted for 294 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y1_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .5108957   .0139975    36.50   0.000     .4833473     .538444
   incentive |   .1331559   .0384377     3.46   0.001     .0575068    .2088049
prox_index~1 |   .0003985   .0054408     0.07   0.942    -.0103094    .0111064
infra_inde~1 |   .0190778     .01544     1.24   0.218    -.0113096    .0494652
        Male |  -.0001131   .0132166    -0.01   0.993    -.0261245    .0258983
          SC |  -.0026406   .0318124    -0.08   0.934    -.0652504    .0599691
          ST |  -.1805675   .0679405    -2.66   0.008    -.3142807   -.0468544
         OBC |   .0114283   .0278251     0.41   0.682    -.0433341    .0661907
parent_lit~x |   .0652491   .0076977     8.48   0.000     .0500994    .0803988
hh_affluen~x |   .0333393   .0058483     5.70   0.000     .0218293    .0448493
       _cons |   -.277492   .1072812    -2.59   0.010    -.4886314   -.0663526
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y1_y0_t_c;

. areg y2_nts_level_mean y1_nts_level_mean incentive [pweight=1/(1-p_only_baseline_y2_y1)]  if sub==2 & inlist(school_treatment,1,4,
> 5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   19423
                                                       F(  2,   297) =  884.44
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3311
                                                       Adj R-squared =  0.3293
                                                       Root MSE      =  .81248

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .6180115   .0146973    42.05   0.000     .5890874    .6469355
   incentive |   .1085792   .0389139     2.79   0.006     .0319973    .1851611
       _cons |  -.0717088   .0291983    -2.46   0.015    -.1291706    -.014247
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y1_t_nc;

. areg y2_nts_level_mean y1_nts_level_mean incentive   `y1_y0_controls' [pweight=1/(1-p_all_controls_y2_y1)] if sub==2 & inlist(scho
> ol_treatment,1,4,5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   16068
                                                       F( 10,   291) =  200.53
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3672
                                                       Adj R-squared =  0.3649
                                                       Root MSE      =  .79812

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1_nts_lev~n |   .6298421   .0147641    42.66   0.000     .6007842       .6589
   incentive |   .0958337   .0398893     2.40   0.017     .0173255    .1743419
prox_index~1 |   .0177697   .0070157     2.53   0.012     .0039617    .0315777
infra_inde~1 |   .0009979   .0187338     0.05   0.958     -.035873    .0378689
        Male |  -.0255201   .0161982    -1.58   0.116    -.0574006    .0063603
          SC |    -.05576   .0376697    -1.48   0.140    -.1298995    .0183795
          ST |  -.1012503   .0744659    -1.36   0.175    -.2478103    .0453097
         OBC |  -.0304252   .0276919    -1.10   0.273    -.0849271    .0240766
parent_lit~x |    .048683     .00758     6.42   0.000     .0337644    .0636016
hh_affluen~x |    .025473   .0067895     3.75   0.000     .0121102    .0388358
       _cons |   -.403852   .1373453    -2.94   0.004     -.674168   -.1335359
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y1_t_c;

. areg y2_nts_level_mean y0_nts  incentive [pweight=1/(1-p_only_baseline_y2)]  if sub==2 & inlist(school_treatment,1,4,5) & cheaters
> ==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   14963
                                                       F(  2,   297) =  627.47
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2511
                                                       Adj R-squared =  0.2485
                                                       Root MSE      =  .84059

                        (Std. Err. adjusted for 298 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4867968   .0142763    34.10   0.000     .4587011    .5148924
   incentive |   .1630593   .0441372     3.69   0.000      .076198    .2499206
       _cons |  -.0766245   .0321979    -2.38   0.018    -.1399894   -.0132596
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y0_t_nc;

. areg y2_nts_level_mean y0_nts  incentive `y1_y0_controls' [pweight=1/(1-p_all_controls_y2)]  if sub==2 & inlist(school_treatment,1
> ,4,5) & cheaters==0, absorb(U_MC) cluster(apfschoolcode);

Linear regression, absorbing indicators                Number of obs =   12410
                                                       F( 10,   291) =  150.05
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2972
                                                       Adj R-squared =  0.2938
                                                       Root MSE      =  .81202

                        (Std. Err. adjusted for 292 clusters in apfschoolcode)
------------------------------------------------------------------------------
             |               Robust
y2_nts_lev~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y0_nts |   .4785322   .0143899    33.25   0.000     .4502107    .5068538
   incentive |   .1638525   .0440694     3.72   0.000     .0771173    .2505878
prox_index~1 |   .0123116   .0082972     1.48   0.139    -.0040186    .0286418
infra_inde~1 |   .0112662   .0220962     0.51   0.611    -.0322225    .0547549
        Male |  -.0089373   .0168916    -0.53   0.597    -.0421825     .024308
          SC |  -.0225181   .0426688    -0.53   0.598    -.1064967    .0614605
          ST |  -.1163583   .0674178    -1.73   0.085    -.2490467      .01633
         OBC |   .0261323    .031518     0.83   0.408    -.0358998    .0881644
parent_lit~x |   .0705124    .008345     8.45   0.000     .0540882    .0869367
hh_affluen~x |   .0378803   .0080209     4.72   0.000      .022094    .0536665
       _cons |  -.5005774   .1597987    -3.13   0.002    -.8150851   -.1860697
-------------+----------------------------------------------------------------
        U_MC |   absorbed                                      (50 categories)

. estimates store  y2_y0_t_c;

. estout y1_y0_t_nc y1_y0_t_c y2_y1_t_nc y2_y1_t_c y2_y0_t_nc y2_y0_t_c  ,stats(N r2)  cells(b(fmt(3)) se(par star fmt(3)))starlevel
> s(* 0.10 ** 0.05 *** .01 );

------------------------------------------------------------------------------------------------------------
               y1_y0_t_nc       y1_y0_t_c      y2_y1_t_nc       y2_y1_t_c      y2_y0_t_nc       y2_y0_t_c   
                     b/se            b/se            b/se            b/se            b/se            b/se   
------------------------------------------------------------------------------------------------------------
y0_nts              0.520           0.511                                           0.487           0.479   
                  (0.014)***      (0.014)***                                      (0.014)***      (0.014)***
incentive           0.117           0.133           0.109           0.096           0.163           0.164   
                  (0.039)***      (0.038)***      (0.039)***      (0.040)**       (0.044)***      (0.044)***
prox_index~1                        0.000                           0.018                           0.012   
                                  (0.005)                         (0.007)**                       (0.008)   
infra_inde~1                        0.019                           0.001                           0.011   
                                  (0.015)                         (0.019)                         (0.022)   
Male                               -0.000                          -0.026                          -0.009   
                                  (0.013)                         (0.016)                         (0.017)   
SC                                 -0.003                          -0.056                          -0.023   
                                  (0.032)                         (0.038)                         (0.043)   
ST                                 -0.181                          -0.101                          -0.116   
                                  (0.068)***                      (0.074)                         (0.067)*  
OBC                                 0.011                          -0.030                           0.026   
                                  (0.028)                         (0.028)                         (0.032)   
parent_lit~x                        0.065                           0.049                           0.071   
                                  (0.008)***                      (0.008)***                      (0.008)***
hh_affluen~x                        0.033                           0.025                           0.038   
                                  (0.006)***                      (0.007)***                      (0.008)***
y1_nts_lev~n                                        0.618           0.630                                   
                                                  (0.015)***      (0.015)***                                
_cons              -0.020          -0.277          -0.072          -0.404          -0.077          -0.501   
                  (0.032)         (0.107)**       (0.029)**       (0.137)***      (0.032)**       (0.160)***
------------------------------------------------------------------------------------------------------------
N               21199.000       18917.000       19423.000       16068.000       14963.000       12410.000   
r2                  0.331           0.364           0.331           0.367           0.251           0.297   
------------------------------------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  c:\JPE\stata\\logs\\Incentives_JPE_table2_SA.txt
  log type:  text
 closed on:   8 Feb 2011, 13:22:53
------------------------------------------------------------------------------------------------------------------------------------
